      ******************************************************************
      * CIS/CSC - 304 - COBOL
      * Assignment 2
      * 
      * Authors: ROBERT KRENCY
      * 
      ******************************************************************

       IDENTIFICATION DIVISION.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT2.
       AUTHOR. 'ROBERT KRENCY'.
      * TODO: ADD AUTHOR NAMES



       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.



       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.




       PROCEDURE DIVISION.
