       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT1.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
       


       PROCEDURE DIVISION.

           GOBACK.

       END PROGRAM ASSIGNMENT1.