       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT1.
       AUTHOR. 'KRENCY-KRESS-PADILLA'.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMER-FILE ASSIGN TO 'INPUT.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT GOOD-RECORDS ASSIGN TO 'GOOD.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT BAD-RECORDS ASSIGN TO 'BAD.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.


       DATA DIVISION.
       FILE SECTION.

      * CUSTOMER FILE INFORMATION
       FD CUSTOMER-FILE
           RECORD CONTAINS 70 CHARACTERS
           DATA RECORD IS CUSTOMER.
       01 CUSTOMER.
         03 FIRST-NAME PIC X(12).
         03 LAST-NAME PIC X(12).
         03 STREET-ADDRESS PIC X(15).
         03 CITY PIC X(13).
         03 STATE PIC X(2).
         03 ACCOUNT-NUMBER PIC 9(6).
         03 PREV-METER-READING PIC 9(5).
         03 CURR-METER-READING PIC 9(5).

      * GOOD RECORD OUTPUT INFORMATION
       FD GOOD-RECORDS
           RECORD CONTAINS 50 CHARACTERS
           DATA RECORD IS GOOD-RECORD.
       01 GOOD-RECORD.
         03 LAST-NAME PIC X(12).
         03 FIRST-NAME PIC X(12).
         03 ACCOUNT-NUMBER PIC 9(6).
         03 STREET-ADDRESS PIC X(15).
         03 UNITS-USED PIC 9(5).

      * BAD RECORD OUTPUT INFORMATION
       FD BAD-RECORDS
           RECORD CONTAINS 16 CHARACTERS
           DATA RECORD IS BAD-RECORD.
       01 BAD-RECORD.
         03 ACCOUNT-NUMBER PIC 9(6).
         03 CURR-READING PIC 9(5).
         03 PREV-READING PIC 9(5).

       WORKING-STORAGE SECTION.
       


       PROCEDURE DIVISION.

           GOBACK.

       END PROGRAM ASSIGNMENT1.